{"type":"protocol","name":"agl_screenshooter","copyright":{"type":"copyright","text":"Copyright © 2020 Collabora. Ltd,\n\n    Permission is hereby granted, free of charge, to any person obtaining a\n    copy of this software and associated documentation files (the \"Software\"),\n    to deal in the Software without restriction, including without limitation\n    the rights to use, copy, modify, merge, publish, distribute, sublicense,\n    and/or sell copies of the Software, and to permit persons to whom the\n    Software is furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice (including the next\n    paragraph) shall be included in all copies or substantial portions of the\n    Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL\n    THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n    FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\n    DEALINGS IN THE SOFTWARE."},"interfaces":[{"type":"interface","name":"agl_screenshooter","version":"1","description":{"type":"description","text":"agl compositor extension that performs a screenshot of the output, which\n      is represented by a 'wl_output' object.\n\n      A client would call 'take_shot' request and wait until the compositor\n      finishes to write the data to a wayland buffer, moment in which signals\n      back the client with the help of the 'done' event. Clients should wait\n      until the 'done' event is received, if they want to take another\n      screenshot, or take another screnshot of a different output.\n\n      The client must provide a wl_shm-based wl_buffer of the correct size when\n      taking a shot. The compositor will write the shot into the wl_buffer and then\n      send the 'done' event that signals completion of writing the data.\n\n      Once the compositor has finished to transfer the data back into the supplied\n      wayland buffer, the client should be able to transfer it to a popular\n      file format on the disk.","summary":"agl screenshooter"},"requests":[{"type":"request","name":"take_shot","description":{"type":"description","text":"Takes a screenshot of the wayland output represented by a 'wl_output'\n        object. Clients should first retrieve it using global registry, as well\n        as the 'wl_shm' object in order to create a wayland buffer type of\n        object ('wl_buffer').\n\n        Clients can derive the stride and size from the 'wl_output' object, and\n        later on use those when creating shm-based 'wl_buffer', as well as supplying\n        the pixel format.","summary":"performs a screenshot"},"args":[{"type":"arg","name":"output","argType":"object","interface":"wl_output"},{"type":"arg","name":"buffer","argType":"object","interface":"wl_buffer"}]},{"type":"request","name":"destroy","requestType":"destructor","description":{"type":"description","text":"Destroys the 'weston_screenshooter' interface.","summary":"destroy main object"},"args":[]}],"events":[{"type":"event","name":"done","description":{"type":"description","text":"Even sent back to notify client 'take_shot' request has completed.","summary":"sent when 'take_shot' finished"},"args":[{"type":"arg","name":"status","argType":"uint","enum":"done_status"}]}],"enums":[{"type":"enum","name":"done_status","bitfield":false,"entries":[{"type":"entry","name":"success","value":"0"},{"type":"entry","name":"no_memory","value":"1"},{"type":"entry","name":"bad_buffer","value":"2"}]}]}]}