{
  "type": "protocol",
  "name": "alpha_modifier_v1",
  "copyright": {
    "type": "copyright",
    "text": "Copyright © 2024 Xaver Hugl\n\nPermission is hereby granted, free of charge, to any person obtaining a\ncopy of this software and associated documentation files (the \"Software\"),\nto deal in the Software without restriction, including without limitation\nthe rights to use, copy, modify, merge, publish, distribute, sublicense,\nand/or sell copies of the Software, and to permit persons to whom the\nSoftware is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice (including the next\nparagraph) shall be included in all copies or substantial portions of the\nSoftware.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL\nTHE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\nDEALINGS IN THE SOFTWARE."
  },
  "interfaces": [
    {
      "type": "interface",
      "name": "wp_alpha_modifier_v1",
      "version": "1",
      "description": {
        "type": "description",
        "text": "This interface allows a client to set a factor for the alpha values on a\nsurface, which can be used to offload such operations to the compositor,\nwhich can in turn for example offload them to KMS.\n\nWarning! The protocol described in this file is currently in the testing\nphase. Backward compatible changes may be added together with the\ncorresponding interface version bump. Backward incompatible changes can\nonly be done by creating a new major version of the extension.",
        "summary": "surface alpha modifier manager"
      },
      "requests": [
        {
          "type": "request",
          "name": "destroy",
          "requestType": "destructor",
          "description": {
            "type": "description",
            "text": "Destroy the alpha modifier manager. This doesn't destroy objects\ncreated with the manager.",
            "summary": "destroy the alpha modifier manager object"
          },
          "args": []
        },
        {
          "type": "request",
          "name": "get_surface",
          "description": {
            "type": "description",
            "text": "Create a new alpha modifier surface object associated with the\ngiven wl_surface. If there is already such an object associated with\nthe wl_surface, the already_constructed error will be raised.",
            "summary": "create a new toplevel decoration object"
          },
          "args": [
            {
              "type": "arg",
              "name": "id",
              "argType": "new_id",
              "interface": "wp_alpha_modifier_surface_v1"
            },
            {
              "type": "arg",
              "name": "surface",
              "argType": "object",
              "interface": "wl_surface",
              "protocol": "wayland"
            }
          ]
        }
      ],
      "events": [],
      "enums": [
        {
          "type": "enum",
          "name": "error",
          "bitfield": false,
          "entries": [
            {
              "type": "entry",
              "name": "already_constructed",
              "value": "0",
              "summary": "wl_surface already has a alpha modifier object"
            }
          ]
        }
      ]
    },
    {
      "type": "interface",
      "name": "wp_alpha_modifier_surface_v1",
      "version": "1",
      "description": {
        "type": "description",
        "text": "This interface allows the client to set a factor for the alpha values on\na surface, which can be used to offload such operations to the compositor.\nThe default factor is UINT32_MAX.\n\nThis object has to be destroyed before the associated wl_surface. Once the\nwl_surface is destroyed, all request on this object will raise the\nno_surface error.",
        "summary": "alpha modifier object for a surface"
      },
      "requests": [
        {
          "type": "request",
          "name": "destroy",
          "requestType": "destructor",
          "description": {
            "type": "description",
            "text": "This destroys the object, and is equivalent to set_multiplier with\na value of UINT32_MAX, with the same double-buffered semantics as\nset_multiplier.",
            "summary": "destroy the alpha modifier object"
          },
          "args": []
        },
        {
          "type": "request",
          "name": "set_multiplier",
          "description": {
            "type": "description",
            "text": "Sets the alpha multiplier for the surface. The alpha multiplier is\ndouble-buffered state, see wl_surface.commit for details.\n\nThis factor is applied in the compositor's blending space, as an\nadditional step after the processing of per-pixel alpha values for the\nwl_surface. The exact meaning of the factor is thus undefined, unless\nthe blending space is specified in a different extension.\n\nThis multiplier is applied even if the buffer attached to the\nwl_surface doesn't have an alpha channel; in that case an alpha value\nof one is used instead.\n\nZero means completely transparent, UINT32_MAX means completely opaque.",
            "summary": "specify the alpha multiplier"
          },
          "args": [
            {
              "type": "arg",
              "name": "factor",
              "argType": "uint"
            }
          ]
        }
      ],
      "events": [],
      "enums": [
        {
          "type": "enum",
          "name": "error",
          "bitfield": false,
          "entries": [
            {
              "type": "entry",
              "name": "no_surface",
              "value": "0",
              "summary": "wl_surface was destroyed"
            }
          ]
        }
      ]
    }
  ]
}
