{"type":"protocol","name":"ext_transient_seat_v1","copyright":{"type":"copyright","text":"Copyright © 2020 - 2023 Andri Yngvason\n\n    Permission is hereby granted, free of charge, to any person obtaining a\n    copy of this software and associated documentation files (the \"Software\"),\n    to deal in the Software without restriction, including without limitation\n    the rights to use, copy, modify, merge, publish, distribute, sublicense,\n    and/or sell copies of the Software, and to permit persons to whom the\n    Software is furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice (including the next\n    paragraph) shall be included in all copies or substantial portions of the\n    Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL\n    THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n    FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\n    DEALINGS IN THE SOFTWARE."},"description":{"type":"description","text":"The transient seat protocol can be used by privileged clients to create\n    independent seats that will be removed from the compositor when the client\n    destroys its transient seat.\n\n    This protocol is intended for use with virtual input protocols such as\n    \"virtual_keyboard_unstable_v1\" or \"wlr_virtual_pointer_unstable_v1\", both\n    of which allow the user to select a seat.\n\n    The \"wl_seat\" global created by this protocol does not generate input events\n    on its own, or have any capabilities except those assigned to it by other\n    protocol extensions, such as the ones mentioned above.\n\n    For example, a remote desktop server can create a seat with virtual inputs\n    for each remote user by following these steps for each new connection:\n     * Create a transient seat\n     * Wait for the transient seat to be created\n     * Locate a \"wl_seat\" global with a matching name\n     * Create virtual inputs using the resulting \"wl_seat\" global","summary":"protocol for creating temporary seats"},"interfaces":[{"type":"interface","name":"ext_transient_seat_manager_v1","version":"1","description":{"type":"description","text":"The transient seat manager creates short-lived seats.","summary":"transient seat manager"},"requests":[{"type":"request","name":"create","description":{"type":"description","text":"Create a new seat that is removed when the client side transient seat\n        object is destroyed.\n\n        The actual seat may be removed sooner, in which case the transient seat\n        object shall become inert.","summary":"create a transient seat"},"args":[{"type":"arg","name":"seat","argType":"new_id","interface":"ext_transient_seat_v1"}]},{"type":"request","name":"destroy","requestType":"destructor","description":{"type":"description","text":"Destroy the manager.\n\n        All objects created by the manager will remain valid until they are\n        destroyed themselves.","summary":"destroy the manager"},"args":[]}],"events":[],"enums":[]},{"type":"interface","name":"ext_transient_seat_v1","version":"1","description":{"type":"description","text":"When the transient seat handle is destroyed, the seat itself will also be\n      destroyed.","summary":"transient seat handle"},"requests":[{"type":"request","name":"destroy","requestType":"destructor","description":{"type":"description","text":"When the transient seat object is destroyed by the client, the\n        associated seat created by the compositor is also destroyed.","summary":"destroy transient seat"},"args":[]}],"events":[{"type":"event","name":"ready","description":{"type":"description","text":"This event advertises the global name for the wl_seat to be used with\n        wl_registry_bind.\n\n        It is sent exactly once, immediately after the transient seat is created\n        and the new \"wl_seat\" global is advertised, if and only if the creation\n        of the transient seat was allowed.","summary":"transient seat is ready"},"args":[{"type":"arg","name":"global_name","argType":"uint"}]},{"type":"event","name":"denied","description":{"type":"description","text":"The event informs the client that the compositor denied its request to\n        create a transient seat.\n\n        It is sent exactly once, immediately after the transient seat object is\n        created, if and only if the creation of the transient seat was denied.\n\n        After receiving this event, the client should destroy the object.","summary":"transient seat creation denied"},"args":[]}],"enums":[]}]}