{
  "type": "protocol",
  "name": "text_input_unstable_v3",
  "copyright": {
    "type": "copyright",
    "text": "Copyright © 2012, 2013 Intel Corporation\nCopyright © 2015, 2016 Jan Arne Petersen\nCopyright © 2017, 2018 Red Hat, Inc.\nCopyright © 2018       Purism SPC\n\nPermission to use, copy, modify, distribute, and sell this\nsoftware and its documentation for any purpose is hereby granted\nwithout fee, provided that the above copyright notice appear in\nall copies and that both that copyright notice and this permission\nnotice appear in supporting documentation, and that the name of\nthe copyright holders not be used in advertising or publicity\npertaining to distribution of the software without specific,\nwritten prior permission.  The copyright holders make no\nrepresentations about the suitability of this software for any\npurpose.  It is provided \"as is\" without express or implied\nwarranty.\n\nTHE COPYRIGHT HOLDERS DISCLAIM ALL WARRANTIES WITH REGARD TO THIS\nSOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS, IN NO EVENT SHALL THE COPYRIGHT HOLDERS BE LIABLE FOR ANY\nSPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\nWHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN\nAN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION,\nARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF\nTHIS SOFTWARE."
  },
  "description": {
    "type": "description",
    "text": "This protocol allows compositors to act as input methods and to send text\nto applications. A text input object is used to manage state of what are\ntypically text entry fields in the application.\n\nThis document adheres to the RFC 2119 when using words like \"must\",\n\"should\", \"may\", etc.\n\nWarning! The protocol described in this file is experimental and\nbackward incompatible changes may be made. Backward compatible changes\nmay be added together with the corresponding interface version bump.\nBackward incompatible changes are done by bumping the version number in\nthe protocol and interface names and resetting the interface version.\nOnce the protocol is to be declared stable, the 'z' prefix and the\nversion number in the protocol and interface names are removed and the\ninterface version number is reset.",
    "summary": "Protocol for composing text"
  },
  "interfaces": [
    {
      "type": "interface",
      "name": "zwp_text_input_v3",
      "version": "1",
      "description": {
        "type": "description",
        "text": "The zwp_text_input_v3 interface represents text input and input methods\nassociated with a seat. It provides enter/leave events to follow the\ntext input focus for a seat.\n\nRequests are used to enable/disable the text-input object and set\nstate information like surrounding and selected text or the content type.\nThe information about the entered text is sent to the text-input object\nvia the preedit_string and commit_string events.\n\nText is valid UTF-8 encoded, indices and lengths are in bytes. Indices\nmust not point to middle bytes inside a code point: they must either\npoint to the first byte of a code point or to the end of the buffer.\nLengths must be measured between two valid indices.\n\nFocus moving throughout surfaces will result in the emission of\nzwp_text_input_v3.enter and zwp_text_input_v3.leave events. The focused\nsurface must commit zwp_text_input_v3.enable and\nzwp_text_input_v3.disable requests as the keyboard focus moves across\neditable and non-editable elements of the UI. Those two requests are not\nexpected to be paired with each other, the compositor must be able to\nhandle consecutive series of the same request.\n\nState is sent by the state requests (set_surrounding_text,\nset_content_type and set_cursor_rectangle) and a commit request. After an\nenter event or disable request all state information is invalidated and\nneeds to be resent by the client.",
        "summary": "text input"
      },
      "requests": [
        {
          "type": "request",
          "name": "destroy",
          "requestType": "destructor",
          "description": {
            "type": "description",
            "text": "Destroy the wp_text_input object. Also disables all surfaces enabled\nthrough this wp_text_input object.",
            "summary": "Destroy the wp_text_input"
          },
          "args": []
        },
        {
          "type": "request",
          "name": "enable",
          "description": {
            "type": "description",
            "text": "Requests text input on the surface previously obtained from the enter\nevent.\n\nThis request must be issued every time the active text input changes\nto a new one, including within the current surface. Use\nzwp_text_input_v3.disable when there is no longer any input focus on\nthe current surface.\n\nClients must not enable more than one text input on the single seat\nand should disable the current text input before enabling the new one.\nAt most one instance of text input may be in enabled state per instance,\nRequests to enable the another text input when some text input is active\nmust be ignored by compositor.\n\nThis request resets all state associated with previous enable, disable,\nset_surrounding_text, set_text_change_cause, set_content_type, and\nset_cursor_rectangle requests, as well as the state associated with\npreedit_string, commit_string, and delete_surrounding_text events.\n\nThe set_surrounding_text, set_content_type and set_cursor_rectangle\nrequests must follow if the text input supports the necessary\nfunctionality.\n\nState set with this request is double-buffered. It will get applied on\nthe next zwp_text_input_v3.commit request, and stay valid until the\nnext committed enable or disable request.\n\nThe changes must be applied by the compositor after issuing a\nzwp_text_input_v3.commit request.",
            "summary": "Request text input to be enabled"
          },
          "args": []
        },
        {
          "type": "request",
          "name": "disable",
          "description": {
            "type": "description",
            "text": "Explicitly disable text input on the current surface (typically when\nthere is no focus on any text entry inside the surface).\n\nState set with this request is double-buffered. It will get applied on\nthe next zwp_text_input_v3.commit request.",
            "summary": "Disable text input on a surface"
          },
          "args": []
        },
        {
          "type": "request",
          "name": "set_surrounding_text",
          "description": {
            "type": "description",
            "text": "Sets the surrounding plain text around the input, excluding the preedit\ntext.\n\nThe client should notify the compositor of any changes in any of the\nvalues carried with this request, including changes caused by handling\nincoming text-input events as well as changes caused by other\nmechanisms like keyboard typing.\n\nIf the client is unaware of the text around the cursor, it should not\nissue this request, to signify lack of support to the compositor.\n\nText is UTF-8 encoded, and should include the cursor position, the\ncomplete selection and additional characters before and after them.\nThere is a maximum length of wayland messages, so text can not be\nlonger than 4000 bytes.\n\nCursor is the byte offset of the cursor within text buffer.\n\nAnchor is the byte offset of the selection anchor within text buffer.\nIf there is no selected text, anchor is the same as cursor.\n\nIf any preedit text is present, it is replaced with a cursor for the\npurpose of this event.\n\nValues set with this request are double-buffered. They will get applied\non the next zwp_text_input_v3.commit request, and stay valid until the\nnext committed enable or disable request.\n\nThe initial state for affected fields is empty, meaning that the text\ninput does not support sending surrounding text. If the empty values\nget applied, subsequent attempts to change them may have no effect.",
            "summary": "sets the surrounding text"
          },
          "args": [
            {
              "type": "arg",
              "name": "text",
              "argType": "string"
            },
            {
              "type": "arg",
              "name": "cursor",
              "argType": "int"
            },
            {
              "type": "arg",
              "name": "anchor",
              "argType": "int"
            }
          ]
        },
        {
          "type": "request",
          "name": "set_text_change_cause",
          "description": {
            "type": "description",
            "text": "Tells the compositor why the text surrounding the cursor changed.\n\nWhenever the client detects an external change in text, cursor, or\nanchor posision, it must issue this request to the compositor. This\nrequest is intended to give the input method a chance to update the\npreedit text in an appropriate way, e.g. by removing it when the user\nstarts typing with a keyboard.\n\ncause describes the source of the change.\n\nThe value set with this request is double-buffered. It must be applied\nand reset to initial at the next zwp_text_input_v3.commit request.\n\nThe initial value of cause is input_method.",
            "summary": "indicates the cause of surrounding text change"
          },
          "args": [
            {
              "type": "arg",
              "name": "cause",
              "argType": "uint",
              "enum": "change_cause"
            }
          ]
        },
        {
          "type": "request",
          "name": "set_content_type",
          "description": {
            "type": "description",
            "text": "Sets the content purpose and content hint. While the purpose is the\nbasic purpose of an input field, the hint flags allow to modify some of\nthe behavior.\n\nValues set with this request are double-buffered. They will get applied\non the next zwp_text_input_v3.commit request.\nSubsequent attempts to update them may have no effect. The values\nremain valid until the next committed enable or disable request.\n\nThe initial value for hint is none, and the initial value for purpose\nis normal.",
            "summary": "set content purpose and hint"
          },
          "args": [
            {
              "type": "arg",
              "name": "hint",
              "argType": "uint",
              "enum": "content_hint"
            },
            {
              "type": "arg",
              "name": "purpose",
              "argType": "uint",
              "enum": "content_purpose"
            }
          ]
        },
        {
          "type": "request",
          "name": "set_cursor_rectangle",
          "description": {
            "type": "description",
            "text": "Marks an area around the cursor as a x, y, width, height rectangle in\nsurface local coordinates.\n\nAllows the compositor to put a window with word suggestions near the\ncursor, without obstructing the text being input.\n\nIf the client is unaware of the position of edited text, it should not\nissue this request, to signify lack of support to the compositor.\n\nValues set with this request are double-buffered. They will get applied\non the next zwp_text_input_v3.commit request, and stay valid until the\nnext committed enable or disable request.\n\nThe initial values describing a cursor rectangle are empty. That means\nthe text input does not support describing the cursor area. If the\nempty values get applied, subsequent attempts to change them may have\nno effect.",
            "summary": "set cursor position"
          },
          "args": [
            {
              "type": "arg",
              "name": "x",
              "argType": "int"
            },
            {
              "type": "arg",
              "name": "y",
              "argType": "int"
            },
            {
              "type": "arg",
              "name": "width",
              "argType": "int"
            },
            {
              "type": "arg",
              "name": "height",
              "argType": "int"
            }
          ]
        },
        {
          "type": "request",
          "name": "commit",
          "description": {
            "type": "description",
            "text": "Atomically applies state changes recently sent to the compositor.\n\nThe commit request establishes and updates the state of the client, and\nmust be issued after any changes to apply them.\n\nText input state (enabled status, content purpose, content hint,\nsurrounding text and change cause, cursor rectangle) is conceptually\ndouble-buffered within the context of a text input, i.e. between a\ncommitted enable request and the following committed enable or disable\nrequest.\n\nProtocol requests modify the pending state, as opposed to the current\nstate in use by the input method. A commit request atomically applies\nall pending state, replacing the current state. After commit, the new\npending state is as documented for each related request.\n\nRequests are applied in the order of arrival.\n\nNeither current nor pending state are modified unless noted otherwise.\n\nThe compositor must count the number of commit requests coming from\neach zwp_text_input_v3 object and use the count as the serial in done\nevents.",
            "summary": "commit state"
          },
          "args": []
        }
      ],
      "events": [
        {
          "type": "event",
          "name": "enter",
          "description": {
            "type": "description",
            "text": "Notification that this seat's text-input focus is on a certain surface.\n\nIf client has created multiple text input objects, compositor must send\nthis event to all of them.\n\nWhen the seat has the keyboard capability the text-input focus follows\nthe keyboard focus. This event sets the current surface for the\ntext-input object.",
            "summary": "enter event"
          },
          "args": [
            {
              "type": "arg",
              "name": "surface",
              "argType": "object",
              "interface": "wl_surface",
              "protocol": "wayland"
            }
          ]
        },
        {
          "type": "event",
          "name": "leave",
          "description": {
            "type": "description",
            "text": "Notification that this seat's text-input focus is no longer on a\ncertain surface. The client should reset any preedit string previously\nset.\n\nThe leave notification clears the current surface. It is sent before\nthe enter notification for the new focus. After leave event, compositor\nmust ignore requests from any text input instances until next enter\nevent.\n\nWhen the seat has the keyboard capability the text-input focus follows\nthe keyboard focus.",
            "summary": "leave event"
          },
          "args": [
            {
              "type": "arg",
              "name": "surface",
              "argType": "object",
              "interface": "wl_surface",
              "protocol": "wayland"
            }
          ]
        },
        {
          "type": "event",
          "name": "preedit_string",
          "description": {
            "type": "description",
            "text": "Notify when a new composing text (pre-edit) should be set at the\ncurrent cursor position. Any previously set composing text must be\nremoved. Any previously existing selected text must be removed.\n\nThe argument text contains the pre-edit string buffer.\n\nThe parameters cursor_begin and cursor_end are counted in bytes\nrelative to the beginning of the submitted text buffer. Cursor should\nbe hidden when both are equal to -1.\n\nThey could be represented by the client as a line if both values are\nthe same, or as a text highlight otherwise.\n\nValues set with this event are double-buffered. They must be applied\nand reset to initial on the next zwp_text_input_v3.done event.\n\nThe initial value of text is an empty string, and cursor_begin,\ncursor_end and cursor_hidden are all 0.",
            "summary": "pre-edit"
          },
          "args": [
            {
              "type": "arg",
              "name": "text",
              "argType": "string",
              "allowNull": "true"
            },
            {
              "type": "arg",
              "name": "cursor_begin",
              "argType": "int"
            },
            {
              "type": "arg",
              "name": "cursor_end",
              "argType": "int"
            }
          ]
        },
        {
          "type": "event",
          "name": "commit_string",
          "description": {
            "type": "description",
            "text": "Notify when text should be inserted into the editor widget. The text to\ncommit could be either just a single character after a key press or the\nresult of some composing (pre-edit).\n\nValues set with this event are double-buffered. They must be applied\nand reset to initial on the next zwp_text_input_v3.done event.\n\nThe initial value of text is an empty string.",
            "summary": "text commit"
          },
          "args": [
            {
              "type": "arg",
              "name": "text",
              "argType": "string",
              "allowNull": "true"
            }
          ]
        },
        {
          "type": "event",
          "name": "delete_surrounding_text",
          "description": {
            "type": "description",
            "text": "Notify when the text around the current cursor position should be\ndeleted.\n\nBefore_length and after_length are the number of bytes before and after\nthe current cursor index (excluding the selection) to delete.\n\nIf a preedit text is present, in effect before_length is counted from\nthe beginning of it, and after_length from its end (see done event\nsequence).\n\nValues set with this event are double-buffered. They must be applied\nand reset to initial on the next zwp_text_input_v3.done event.\n\nThe initial values of both before_length and after_length are 0.",
            "summary": "delete surrounding text"
          },
          "args": [
            {
              "type": "arg",
              "name": "before_length",
              "argType": "uint",
              "summary": "length of text before current cursor position"
            },
            {
              "type": "arg",
              "name": "after_length",
              "argType": "uint",
              "summary": "length of text after current cursor position"
            }
          ]
        },
        {
          "type": "event",
          "name": "done",
          "description": {
            "type": "description",
            "text": "Instruct the application to apply changes to state requested by the\npreedit_string, commit_string and delete_surrounding_text events. The\nstate relating to these events is double-buffered, and each one\nmodifies the pending state. This event replaces the current state with\nthe pending state.\n\nThe application must proceed by evaluating the changes in the following\norder:\n\n1. Replace existing preedit string with the cursor.\n2. Delete requested surrounding text.\n3. Insert commit string with the cursor at its end.\n4. Calculate surrounding text to send.\n5. Insert new preedit text in cursor position.\n6. Place cursor inside preedit text.\n\nThe serial number reflects the last state of the zwp_text_input_v3\nobject known to the compositor. The value of the serial argument must\nbe equal to the number of commit requests already issued on that object.\n\nWhen the client receives a done event with a serial different than the\nnumber of past commit requests, it must proceed with evaluating and\napplying the changes as normal, except it should not change the current\nstate of the zwp_text_input_v3 object. All pending state requests\n(set_surrounding_text, set_content_type and set_cursor_rectangle) on\nthe zwp_text_input_v3 object should be sent and committed after\nreceiving a zwp_text_input_v3.done event with a matching serial.",
            "summary": "apply changes"
          },
          "args": [
            {
              "type": "arg",
              "name": "serial",
              "argType": "uint"
            }
          ]
        }
      ],
      "enums": [
        {
          "type": "enum",
          "name": "change_cause",
          "bitfield": false,
          "description": {
            "type": "description",
            "text": "Reason for the change of surrounding text or cursor posision.",
            "summary": "text change reason"
          },
          "entries": [
            {
              "type": "entry",
              "name": "input_method",
              "value": "0",
              "summary": "input method caused the change"
            },
            {
              "type": "entry",
              "name": "other",
              "value": "1",
              "summary": "something else than the input method caused the change"
            }
          ]
        },
        {
          "type": "enum",
          "name": "content_hint",
          "bitfield": true,
          "description": {
            "type": "description",
            "text": "Content hint is a bitmask to allow to modify the behavior of the text\ninput.",
            "summary": "content hint"
          },
          "entries": [
            {
              "type": "entry",
              "name": "none",
              "value": "0x0",
              "summary": "no special behavior"
            },
            {
              "type": "entry",
              "name": "completion",
              "value": "0x1",
              "summary": "suggest word completions"
            },
            {
              "type": "entry",
              "name": "spellcheck",
              "value": "0x2",
              "summary": "suggest word corrections"
            },
            {
              "type": "entry",
              "name": "auto_capitalization",
              "value": "0x4",
              "summary": "switch to uppercase letters at the start of a sentence"
            },
            {
              "type": "entry",
              "name": "lowercase",
              "value": "0x8",
              "summary": "prefer lowercase letters"
            },
            {
              "type": "entry",
              "name": "uppercase",
              "value": "0x10",
              "summary": "prefer uppercase letters"
            },
            {
              "type": "entry",
              "name": "titlecase",
              "value": "0x20",
              "summary": "prefer casing for titles and headings (can be language dependent)"
            },
            {
              "type": "entry",
              "name": "hidden_text",
              "value": "0x40",
              "summary": "characters should be hidden"
            },
            {
              "type": "entry",
              "name": "sensitive_data",
              "value": "0x80",
              "summary": "typed text should not be stored"
            },
            {
              "type": "entry",
              "name": "latin",
              "value": "0x100",
              "summary": "just Latin characters should be entered"
            },
            {
              "type": "entry",
              "name": "multiline",
              "value": "0x200",
              "summary": "the text input is multiline"
            }
          ]
        },
        {
          "type": "enum",
          "name": "content_purpose",
          "bitfield": false,
          "description": {
            "type": "description",
            "text": "The content purpose allows to specify the primary purpose of a text\ninput.\n\nThis allows an input method to show special purpose input panels with\nextra characters or to disallow some characters.",
            "summary": "content purpose"
          },
          "entries": [
            {
              "type": "entry",
              "name": "normal",
              "value": "0",
              "summary": "default input, allowing all characters"
            },
            {
              "type": "entry",
              "name": "alpha",
              "value": "1",
              "summary": "allow only alphabetic characters"
            },
            {
              "type": "entry",
              "name": "digits",
              "value": "2",
              "summary": "allow only digits"
            },
            {
              "type": "entry",
              "name": "number",
              "value": "3",
              "summary": "input a number (including decimal separator and sign)"
            },
            {
              "type": "entry",
              "name": "phone",
              "value": "4",
              "summary": "input a phone number"
            },
            {
              "type": "entry",
              "name": "url",
              "value": "5",
              "summary": "input an URL"
            },
            {
              "type": "entry",
              "name": "email",
              "value": "6",
              "summary": "input an email address"
            },
            {
              "type": "entry",
              "name": "name",
              "value": "7",
              "summary": "input a name of a person"
            },
            {
              "type": "entry",
              "name": "password",
              "value": "8",
              "summary": "input a password (combine with sensitive_data hint)"
            },
            {
              "type": "entry",
              "name": "pin",
              "value": "9",
              "summary": "input is a numeric password (combine with sensitive_data hint)"
            },
            {
              "type": "entry",
              "name": "date",
              "value": "10",
              "summary": "input a date"
            },
            {
              "type": "entry",
              "name": "time",
              "value": "11",
              "summary": "input a time"
            },
            {
              "type": "entry",
              "name": "datetime",
              "value": "12",
              "summary": "input a date and time"
            },
            {
              "type": "entry",
              "name": "terminal",
              "value": "13",
              "summary": "input for a terminal"
            }
          ]
        }
      ]
    },
    {
      "type": "interface",
      "name": "zwp_text_input_manager_v3",
      "version": "1",
      "description": {
        "type": "description",
        "text": "A factory for text-input objects. This object is a global singleton.",
        "summary": "text input manager"
      },
      "requests": [
        {
          "type": "request",
          "name": "destroy",
          "requestType": "destructor",
          "description": {
            "type": "description",
            "text": "Destroy the wp_text_input_manager object.",
            "summary": "Destroy the wp_text_input_manager"
          },
          "args": []
        },
        {
          "type": "request",
          "name": "get_text_input",
          "description": {
            "type": "description",
            "text": "Creates a new text-input object for a given seat.",
            "summary": "create a new text input object"
          },
          "args": [
            {
              "type": "arg",
              "name": "id",
              "argType": "new_id",
              "interface": "zwp_text_input_v3"
            },
            {
              "type": "arg",
              "name": "seat",
              "argType": "object",
              "interface": "wl_seat",
              "protocol": "wayland"
            }
          ]
        }
      ],
      "events": [],
      "enums": []
    }
  ]
}
