{"type":"protocol","name":"weston_direct_display","copyright":{"type":"copyright","text":"Copyright © 2019 Collabora Ltd.\n\n    Permission is hereby granted, free of charge, to any person obtaining a\n    copy of this software and associated documentation files (the \"Software\"),\n    to deal in the Software without restriction, including without limitation\n    the rights to use, copy, modify, merge, publish, distribute, sublicense,\n    and/or sell copies of the Software, and to permit persons to whom the\n    Software is furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice (including the next\n    paragraph) shall be included in all copies or substantial portions of the\n    Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL\n    THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n    FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\n    DEALINGS IN THE SOFTWARE."},"interfaces":[{"type":"interface","name":"weston_direct_display_v1","version":"1","description":{"type":"description","text":"Weston extension to instruct the compositor to avoid any import\n      of the dmabuf created by 'linux-dmabuf' protocol other than the display\n      controller.\n\n      Compositors are already going to use direct scan-out as much as possible but\n      there's no assurance that while doing so, they won't first import the dmabuf\n      in to the GPU. This extension assures the client that the compositor will\n      never attempt to import in to the GPU and pass it directly to the display\n      controller.\n\n      Clients can make use of this extension to pass the dmabuf buffer to the\n      display controller, potentially increasing the performance and lowering the\n      bandwidth usage.\n\n      Lastly, clients can make use of this extension in tandem with content-protection\n      one thus avoiding any GPU interaction and providing a secure-content path.\n      Also, in some cases, the memory where dmabuf are allocated are in specially\n      crafted memory zone which would be seen as an illegal memory access when the\n      GPU will attempt to read it.\n\n      WARNING: This interface by design might break screenshoting functionality\n      as compositing might be involved while doing that. Also, do note, that in\n      case the dmabufer provided can't be imported by KMS, the client connection\n      will be terminated.\n\n      WARNING: This extension requires 'linux-dmabuf' protocol and\n      'zwp_linux_buffer_params_v1' be already created by 'zwp_linux_buffer_v1'.","summary":"weston direct display"},"requests":[{"type":"request","name":"enable","description":{"type":"description","text":"This request tells the compositor not to import the dmabuf to the GPU\n      in order to bypass it entirely, such that the buffer will be directly\n      scanned-out by the display controller. If HW is not capable/or there\n      aren't any available resources to directly scan-out the buffer, a\n      placeholder should be installed in-place by the compositor. The\n      compositor may perform checks on the dmabuf and refuse to create a\n      wl_buffer if the dmabuf seems unusable for being used directly.\n\n      Assumes that 'zwp_linux_buffer_params_v1' was already created\n      by 'zwp_linux_dmabuf_v1_create_params'.","summary":"forward buffer to display controller"},"args":[{"type":"arg","name":"dmabuf","argType":"object","summary":"enable direct-display for dmabuf buffer","interface":"zwp_linux_buffer_params_v1"}]},{"type":"request","name":"destroy","requestType":"destructor","description":{"type":"description","text":"Destroys the factory object, but does not affect any other objects.","summary":"destroy factory object"},"args":[]}],"events":[],"enums":[]}]}